'{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "the-context-text", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "int32", "sparse": false, "name": "the-context-text"}, "inbound_nodes": []}, {"name": "the-answer-text-up-to-the-current-token", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "int32", "sparse": false, "name": "the-answer-text-up-to-the-current-token"}, "inbound_nodes": []}, {"name": "Shared", "class_name": "Embedding", "config": {"name": "Shared", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 7000, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["the-context-text", 0, 0, {}]], [["the-answer-text-up-to-the-current-token", 0, 0, {}]]]}, {"name": "Encode-context", "class_name": "LSTM", "config": {"name": "Encode-context", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 300, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["Shared", 0, 0, {}]]]}, {"name": "Encode-answer-up-to-the-current-token", "class_name": "LSTM", "config": {"name": "Encode-answer-up-to-the-current-token", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 300, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["Shared", 1, 0, {}]]]}, {"name": "concatenate-the-embeddings-of-the-context-and-the-answer-up-to-current-token", "class_name": "Concatenate", "config": {"name": "concatenate-the-embeddings-of-the-context-and-the-answer-up-to-current-token", "trainable": true, "axis": 1}, "inbound_nodes": [[["Encode-context", 0, 0, {}], ["Encode-answer-up-to-the-current-token", 0, 0, {}]]]}, {"name": "relu-activation", "class_name": "Dense", "config": {"name": "relu-activation", "trainable": true, "units": 3500, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate-the-embeddings-of-the-context-and-the-answer-up-to-current-token", 0, 0, {}]]]}, {"name": "likelihood-of-the-current-token-using-softmax-activation", "class_name": "Dense", "config": {"name": "likelihood-of-the-current-token-using-softmax-activation", "trainable": true, "units": 7000, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu-activation", 0, 0, {}]]]}], "input_layers": [["the-context-text", 0, 0], ["the-answer-text-up-to-the-current-token", 0, 0]], "output_layers": [["likelihood-of-the-current-token-using-softmax-activation", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}'